drop database if exists pipe_db_fvt2 cascade;
create ts database pipe_db_fvt2;

create table defaultdb.mock_sink_to_db (topic string not null,kind string,db_name string,tb_name string,key int8,data string);

--mock test 1
CREATE TABLE pipe_db_fvt2.t1
(
    k_timestamp TIMESTAMPTZ NOT NULL,
    id          INT         NOT NULL,
    e1          INT2,
    e2          INT,
    e3          INT8,
    e4          FLOAT4,
    e5          FLOAT8,
    e6          BOOL,
    e7          TIMESTAMPTZ,
    e8          CHAR(1023),
    e9          NCHAR(255),
    e10         VARCHAR(4096),
    e11         CHAR,
    e12         CHAR(255),
    e13         NCHAR,
    e14         NVARCHAR(4096),
    e15         VARCHAR(1023),
    e16         NVARCHAR(200),
    e17         NCHAR(255),
    e18         CHAR(200),
    e19         VARBYTES,
    e20         VARBYTES(60),
    e21         VARCHAR,
    e22         NVARCHAR
) ATTRIBUTES (code1 INT2 NOT NULL,code2 INT,code3 INT8,
            code4 FLOAT4 ,code5 FLOAT8,
                        code6 BOOL,
                        code7 VARCHAR,code8 VARCHAR(128) NOT NULL,
                        code9 VARBYTES,code10 VARBYTES(60),
                        code11 VARCHAR,code12 VARCHAR(60),
                        code13 CHAR(2),code14 CHAR(1023) NOT NULL,
                        code15 NCHAR,code16 NCHAR(254) NOT NULL)
PRIMARY TAGS(code1,code14,code8,code16);

CREATE TABLE pipe_db_fvt2.t2
(
    k_timestamp TIMESTAMPTZ NOT NULL,
    id          INT         NOT NULL,
    e1          INT2,
    e2          INT,
    e3          INT8,
    e4          FLOAT4,
    e5          FLOAT8,
    e6          BOOL,
    e7          TIMESTAMPTZ,
    e8          CHAR(1023),
    e9          NCHAR(255),
    e10         VARCHAR(4096),
    e11         CHAR,
    e12         CHAR(255),
    e13         NCHAR,
    e14         NVARCHAR(4096),
    e15         VARCHAR(1023),
    e16         NVARCHAR(200),
    e17         NCHAR(255),
    e18         CHAR(200),
    e19         VARBYTES,
    e20         VARBYTES(60),
    e21         VARCHAR,
    e22         NVARCHAR
) ATTRIBUTES (code1 INT2 NOT NULL,code2 INT,code3 INT8,
            code4 FLOAT4 ,code5 FLOAT8,
                        code6 BOOL,
                        code7 VARCHAR,code8 VARCHAR(128) NOT NULL,
                        code9 VARBYTES,code10 VARBYTES(60),
                        code11 VARCHAR,code12 VARCHAR(60),
                        code13 CHAR(2),code14 CHAR(1023) NOT NULL,
                        code15 NCHAR,code16 NCHAR(254) NOT NULL)
PRIMARY TAGS(code1,code14,code8,code16);

-- test CDC components using mock target
create pipe test_pipe_mock1 for table pipe_db_fvt2.t1(*)
       where e1 > 50 with options
       (enable='off',buffer_size='0',ignore_history='off',
       sink='mock://root@127.0.102.145:26257?topic_name=test_topic_mock1&mock_sink_to_db=defaultdb.mock_sink_to_db');
CREATE PIPE test_pipe_mock2 FOR TABLE pipe_db_fvt2.t1(*)
      WHERE code1=0 AND code8='a' AND code14='w' AND code16='a'
      WITH OPTIONS (enable='off',sink='mock://root@127.0.102.145:26257?topic_name=test_topic_mock2&mock_sink_to_db=defaultdb.mock_sink_to_db');

INSERT INTO pipe_db_fvt2.t1 VALUES('0000-1-1 00:00:00',1,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,0,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0');
INSERT INTO pipe_db_fvt2.t1 VALUES('0000-1-2 00:01:00',2,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,0,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0');
INSERT INTO pipe_db_fvt2.t1 VALUES('0000-1-3 00:01:00',3,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,0,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0');
INSERT INTO pipe_db_fvt2.t1 VALUES('0000-1-4 00:01:00',4,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,0,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0');
INSERT INTO pipe_db_fvt2.t1 VALUES('0000-1-5 00:01:00',5,51,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,0,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0');
INSERT INTO pipe_db_fvt2.t1 VALUES('0000-1-6 00:01:00',6,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,0,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0');
INSERT INTO pipe_db_fvt2.t1 VALUES('0000-1-7 00:01:00',7,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,0,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0');
INSERT INTO pipe_db_fvt2.t1 VALUES('0000-1-8 00:01:00',8,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,0,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0');
INSERT INTO pipe_db_fvt2.t1 VALUES('0000-1-9 00:01:00',9,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,0,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0');
INSERT INTO pipe_db_fvt2.t1 VALUES('0000-1-10 00:01:00',10,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,0,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0');

alter pipe test_pipe_mock1 set enable='on';
alter pipe test_pipe_mock2 set enable='on';
alter pipe test_pipe_mock_not_existing set enable='on';
select pg_sleep(2);

INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-1 00:01:00',11,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,1,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST1-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST1-14','\'  ,'test数据库语法查询测试！！！@TEST1-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-1 6:00:00',12,-2,4,99,10.125,200.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,1,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST1-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST1-14','\'  ,'test数据库语法查询测试！！！@TEST1-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-1 12:00:00',13,-5,40,199,30.125,205.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,1,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST1-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST1-14','\'  ,'test数据库语法查询测试！！！@TEST1-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-1 18:00:00',14,5,-40,-199,50.125,305.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,1,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST1-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST1-14','\'  ,'test数据库语法查询测试！！！@TEST1-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-1 24:00:00',15,12,403,222,33.125,444.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,1,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST1-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST1-14','\'  ,'test数据库语法查询测试！！！@TEST1-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-2 00:01:00',16,38,289,123,9099.1,89.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,1,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST1-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST1-14','\'  ,'test数据库语法查询测试！！！@TEST1-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-2 06:00:00',17,876,129,456,145.6,89.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,1,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST1-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST1-14','\'  ,'test数据库语法查询测试！！！@TEST1-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-2 12:00:00',18,987,222,333,245.6,99.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,1,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST1-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST1-14','\'  ,'test数据库语法查询测试！！！@TEST1-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-2 18:00:00',19,187,252,338,249.8,19.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,1,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST1-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST1-14','\'  ,'test数据库语法查询测试！！！@TEST1-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-2 24:00:00',20,107,452,938,49.8,9.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,1,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST1-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST1-14','\'  ,'test数据库语法查询测试！！！@TEST1-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-3 00:01:00',21,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,2,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST2-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST2-14','\'  ,'test数据库语法查询测试！！！@TEST2-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-3 06:00:00',22,-2,4,99,10.125,200.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,2,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST2-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST2-14','\'  ,'test数据库语法查询测试！！！@TEST2-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-3 12:00:00',23,-5,40,199,30.125,205.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,2,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST2-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST2-14','\'  ,'test数据库语法查询测试！！！@TEST2-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-3 18:00:00',24,5,-40,-199,50.125,305.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,2,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST2-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST2-14','\'  ,'test数据库语法查询测试！！！@TEST2-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-3 24:00:00',25,12,403,222,33.125,444.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,2,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST2-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST2-14','\'  ,'test数据库语法查询测试！！！@TEST2-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-4 01:00:00',26,38,289,123,9099.1,89.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,2,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST2-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST2-14','\'  ,'test数据库语法查询测试！！！@TEST2-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-4 05:00:00',27,876,129,456,145.6,89.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,2,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST2-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST2-14','\'  ,'test数据库语法查询测试！！！@TEST2-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-4 11:00:00',28,987,222,333,245.6,99.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,2,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST2-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST2-14','\'  ,'test数据库语法查询测试！！！@TEST2-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-4 19:00:00',29,187,252,338,249.8,19.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,2,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST2-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST2-14','\'  ,'test数据库语法查询测试！！！@TEST2-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-4 22:00:00',30,107,452,938,49.8,9.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,2,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST2-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST2-14','\'  ,'test数据库语法查询测试！！！@TEST2-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-5 00:01:00',31,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,3,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST3-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST3-14','\'  ,'test数据库语法查询测试！！！@TEST3-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-5 06:00:00',32,-2,4,99,10.125,200.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,3,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST3-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST3-14','\'  ,'test数据库语法查询测试！！！@TEST3-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-5 12:00:00',33,-5,40,199,30.125,205.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,3,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST3-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST3-14','\'  ,'test数据库语法查询测试！！！@TEST3-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-5 18:00:00',34,5,-40,-199,50.125,305.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,3,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST3-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST3-14','\'  ,'test数据库语法查询测试！！！@TEST3-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-5 24:00:00',35,12,403,222,33.125,444.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,3,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST3-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST3-14','\'  ,'test数据库语法查询测试！！！@TEST3-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-6 01:00:00',36,38,289,123,9099.1,89.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,3,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST3-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST3-14','\'  ,'test数据库语法查询测试！！！@TEST3-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-6 02:00:00',37,876,129,456,145.6,89.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,3,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST3-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST3-14','\'  ,'test数据库语法查询测试！！！@TEST3-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-6 13:00:00',38,987,222,333,245.6,99.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,3,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST3-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST3-14','\'  ,'test数据库语法查询测试！！！@TEST3-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-6 14:00:00',39,187,252,338,249.8,19.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,3,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST3-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST3-14','\'  ,'test数据库语法查询测试！！！@TEST3-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-6 22:00:00',40,107,452,938,49.8,9.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,3,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST3-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST3-14','\'  ,'test数据库语法查询测试！！！@TEST3-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-7 00:01:00',41,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,4,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST4-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST4-14','\'  ,'test数据库语法查询测试！！！@TEST4-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-7 06:00:00',42,-2,4,99,10.125,200.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,4,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST4-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST4-14','\'  ,'test数据库语法查询测试！！！@TEST4-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-7 12:00:00',43,-5,40,199,30.125,205.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,4,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST4-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST4-14','\'  ,'test数据库语法查询测试！！！@TEST4-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-7 18:00:00',44,5,-40,-199,50.125,305.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,4,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST4-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST4-14','\'  ,'test数据库语法查询测试！！！@TEST4-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-7 24:00:00',45,12,403,222,33.125,444.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,4,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST4-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST4-14','\'  ,'test数据库语法查询测试！！！@TEST4-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-8 01:00:00',46,38,289,123,9099.1,89.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,4,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST4-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST4-14','\'  ,'test数据库语法查询测试！！！@TEST4-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-8 02:00:00',47,876,129,456,145.6,89.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,4,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST4-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST4-14','\'  ,'test数据库语法查询测试！！！@TEST4-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-8 13:00:00',48,987,222,333,245.6,99.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,4,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST4-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST4-14','\'  ,'test数据库语法查询测试！！！@TEST4-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-8 14:00:00',49,187,252,338,249.8,19.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,4,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST4-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST4-14','\'  ,'test数据库语法查询测试！！！@TEST4-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-8 24:00:00',50,107,452,938,49.8,9.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,4,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST4-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST4-14','\'  ,'test数据库语法查询测试！！！@TEST4-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-9 00:01:00',51,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,5,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST5-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST5-14','\'  ,'test数据库语法查询测试！！！@TEST5-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-9 06:00:00',52,-2,4,99,10.125,200.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,5,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST5-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST5-14','\'  ,'test数据库语法查询测试！！！@TEST5-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-9 12:00:00',53,-5,40,199,30.125,205.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,5,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST5-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST5-14','\'  ,'test数据库语法查询测试！！！@TEST5-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-9 18:00:00',54,5,-40,-199,50.125,305.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,5,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST5-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST5-14','\'  ,'test数据库语法查询测试！！！@TEST5-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-9 22:00:00',55,12,403,222,33.125,444.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,5,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST5-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST5-14','\'  ,'test数据库语法查询测试！！！@TEST5-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-10 00:01:00',56,38,289,123,9099.1,89.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,5,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST5-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST5-14','\'  ,'test数据库语法查询测试！！！@TEST5-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-10 06:00:00',57,876,129,456,145.6,89.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,5,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST5-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST5-14','\'  ,'test数据库语法查询测试！！！@TEST5-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-10 12:00:00',58,987,222,333,245.6,99.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,5,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST5-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST5-14','\'  ,'test数据库语法查询测试！！！@TEST5-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-10 18:00:00',59,187,252,338,249.8,19.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,5,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST5-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST5-14','\'  ,'test数据库语法查询测试！！！@TEST5-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-11 24:00:00',60,107,452,938,49.8,9.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,5,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST5-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST5-14','\'  ,'test数据库语法查询测试！！！@TEST5-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-12 00:01:00',61,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,6,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST6-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST6-14','\'  ,'test数据库语法查询测试！！！@TEST6-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-12 06:00:00',62,-2,4,99,10.125,200.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,6,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST6-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST6-14','\'  ,'test数据库语法查询测试！！！@TEST6-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-13 12:00:00',63,-5,40,199,30.125,205.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,6,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST6-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST6-14','\'  ,'test数据库语法查询测试！！！@TEST6-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-13 18:00:00',64,5,-40,-199,50.125,305.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,6,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST6-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST6-14','\'  ,'test数据库语法查询测试！！！@TEST6-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-13 23:00:00',65,12,403,222,33.125,444.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,6,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST6-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST6-14','\'  ,'test数据库语法查询测试！！！@TEST6-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-14 00:01:00',66,38,289,123,9099.1,89.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,6,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST6-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST6-14','\'  ,'test数据库语法查询测试！！！@TEST6-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-14 06:00:00',67,876,129,456,145.6,89.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,6,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST6-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST6-14','\'  ,'test数据库语法查询测试！！！@TEST6-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-15 12:00:00',68,987,222,333,245.6,99.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,6,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST6-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST6-14','\'  ,'test数据库语法查询测试！！！@TEST6-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-15 18:00:00',69,187,252,338,249.8,19.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,6,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST6-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST6-14','\'  ,'test数据库语法查询测试！！！@TEST6-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-16 24:00:00',70,107,452,938,49.8,9.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,6,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST6-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST6-14','\'  ,'test数据库语法查询测试！！！@TEST6-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-17 00:01:00',71,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,7,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST7-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST7-14','\'  ,'test数据库语法查询测试！！！@TEST7-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-17 06:00:00',72,-2,4,99,10.125,200.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,7,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST7-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST7-14','\'  ,'test数据库语法查询测试！！！@TEST7-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-18 12:00:00',73,-5,40,199,30.125,205.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,7,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST7-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST7-14','\'  ,'test数据库语法查询测试！！！@TEST7-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-18 18:00:00',74,5,-40,-199,50.125,305.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,7,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST7-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST7-14','\'  ,'test数据库语法查询测试！！！@TEST7-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-18 24:00:00',75,12,403,222,33.125,444.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,7,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST7-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST7-14','\'  ,'test数据库语法查询测试！！！@TEST7-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-19 00:01:00',76,38,289,123,9099.1,89.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,7,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST7-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST7-14','\'  ,'test数据库语法查询测试！！！@TEST7-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-20 06:00:00',77,876,129,456,145.6,89.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,7,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST7-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST7-14','\'  ,'test数据库语法查询测试！！！@TEST7-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-20 12:00:00',78,987,222,333,245.6,99.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,7,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST7-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST7-14','\'  ,'test数据库语法查询测试！！！@TEST7-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-21 18:00:00',79,187,252,338,249.8,19.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,7,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST7-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST7-14','\'  ,'test数据库语法查询测试！！！@TEST7-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-21 24:00:00',80,107,452,938,49.8,9.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,7,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST7-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST7-14','\'  ,'test数据库语法查询测试！！！@TEST7-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-22 00:01:00',81,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,8,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST8-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST8-14','\'  ,'test数据库语法查询测试！！！@TEST8-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-22 06:00:00',82,-2,4,99,10.125,200.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,8,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST8-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST8-14','\'  ,'test数据库语法查询测试！！！@TEST8-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-23 12:00:00',83,-5,40,199,30.125,205.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,8,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST8-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST8-14','\'  ,'test数据库语法查询测试！！！@TEST8-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-23 18:00:00',84,5,-40,-199,50.125,305.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,8,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST8-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST8-14','\'  ,'test数据库语法查询测试！！！@TEST8-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-23 24:00:00',85,12,403,222,33.125,444.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,8,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST8-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST8-14','\'  ,'test数据库语法查询测试！！！@TEST8-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-24 00:01:00',86,38,289,123,9099.1,89.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,8,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST8-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST8-14','\'  ,'test数据库语法查询测试！！！@TEST8-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-25 06:00:00',87,876,129,456,145.6,89.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,8,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST8-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST8-14','\'  ,'test数据库语法查询测试！！！@TEST8-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-25 12:00:00',88,987,222,333,245.6,99.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,8,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST8-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST8-14','\'  ,'test数据库语法查询测试！！！@TEST8-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-26 18:00:00',89,187,252,338,249.8,19.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,8,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST8-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST8-14','\'  ,'test数据库语法查询测试！！！@TEST8-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2024-6-26 24:00:00',90,107,452,938,49.8,9.657,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,8,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'test数据库语法查询测试！！！@TEST8-8',' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'test数据库语法查询测试！！！@TEST8-14','\'  ,'test数据库语法查询测试！！！@TEST8-16');
INSERT INTO pipe_db_fvt2.t1 VALUES('2969-1-1 00:00:00',91,0,0,0,0,0,true,0,'','','','','','','','','','','','','','','',9,0,0,0,0,false,'','\0\0中文te@@~eng TE./。\0\\0\0','','','','','','\0\0中文te@@~eng TE./。。。','','\0\0中文te@@~eng TE./。。。');
INSERT INTO pipe_db_fvt2.t1 VALUES('2969-1-2 00:00:00',92,0,0,0,0,0,true,999999,'          ','          ','          ',' ','          ',' ',' ','          ','          ','          ',' ',' ','          ','          ','          ',9,0,0,0,0,TRUE,'          ','\0\0中文te@@~eng TE./。\0\\0\0',' ','          ','          ','          ','  ','\0\0中文te@@~eng TE./。。。',' ','\0\0中文te@@~eng TE./。。。');
INSERT INTO pipe_db_fvt2.t1 VALUES('2969-1-3 00:00:00',93,10001,10000001,100000000001,-1047200.00312001,-1109810.113011921,true,'2021-3-1 12:00:00.909','test数据库语法查询测试！！！@TEST3-8','test数据库语法查询测试！！！@TEST3-9','test数据库语法查询测试！！！@TEST3-10','t','test数据库语法查询测试！！！@TEST3-12','中','test数据库语法查询测试！！！@TEST3-14','test数据库语法查询测试！！！@TEST3-15','test数据库语法查询测试！TEST3-16xaa','test数据库语法查询测试！！！@TEST3-17','test数据库语法查询测试！！！@TEST3-18',b'\xca','test数据库语法查询测试！！！@TEST3-20','test数据库语法查询测试！！！@TEST3-21','test数据库语法查询测试！！！@TEST3-22',9,10000001,-100000000001,1047200.00312001,-1109810.113011921,false,'test数据库语法查询测试！！！@TEST3-7','\0\0中文te@@~eng TE./。\0\\0\0',b'\xaa','test数据库语法查询测试！！！@TEST3-10','test数据库语法查询测试！！！@TEST3-11','test数据库语法查询测试！！！@TEST3-12','t3','\0\0中文te@@~eng TE./。。。','中','\0\0中文te@@~eng TE./。。。');
INSERT INTO pipe_db_fvt2.t1 VALUES('2969-1-4 00:00:00',94,20002,20000002,200000000002,-20873209.0220322201,-22012110.113011921,false,123,'test数据库语法查询测试！！！@TEST4-8','test数据库语法查询测试！！！@TEST4-9','test数据库语法查询测试！！！@TEST4-10','t','test数据库语法查询测试！！！@TEST4-12','中','test数据库语法查询测试！！！@TEST4-14','test数据库语法查询测试！！！@TEST4-15','test数据库语法查询测试！TEST4-16xaa','test数据库语法查询测试！！！@TEST4-17','test数据库语法查询测试！！！@TEST4-18',b'\xca','test数据库语法查询测试！！！@TEST4-20','test数据库语法查询测试！！！@TEST4-21','test数据库语法查询测试！！！@TEST4-22',9,-20000002,200000000002,-20873209.0220322201,22012110.113011921,true,'test数据库语法查询测试！！！@TEST4-7','\0\0中文te@@~eng TE./。\0\\0\0',b'\xbb','test数据库语法查询测试！！！@TEST4-10','test数据库语法查询测试！！！@TEST4-11','test数据库语法查询测试！！！@TEST4-12','t3','\0\0中文te@@~eng TE./。。。','中','\0\0中文te@@~eng TE./。。。');
INSERT INTO pipe_db_fvt2.t1 VALUES('2969-1-5 00:00:00',95,30003,30000003,300000000003,-33472098.11312001,-39009810.333011921,true,'2015-3-12 10:00:00.234','test数据库语法查询测试！！！@TEST5-8','test数据库语法查询测试！！！@TEST5-9','test数据库语法查询测试！！！@TEST5-10','t','test数据库语法查询测试！！！@TEST5-12','中','test数据库语法查询测试！！！@TEST5-14','test数据库语法查询测试！！！@TEST5-15','test数据库语法查询测试！TEST5-16xaa','test数据库语法查询测试！！！@TEST5-17','test数据库语法查询测试！！！@TEST5-18',b'\xca','test数据库语法查询测试！！！@TEST5-20','test数据库语法查询测试！！！@TEST5-21','test数据库语法查询测试！！！@TEST5-22',9,30000003,-300000000003,33472098.11312001,-39009810.333011921,false,'test数据库语法查询测试！！！@TEST5-7','\0\0中文te@@~eng TE./。\0\\0\0',b'\xcc','test数据库语法查询测试！！！@TEST5-10','test数据库语法查询测试！！！@TEST5-11','test数据库语法查询测试！！！@TEST5-12','t3','\0\0中文te@@~eng TE./。。。','中','\0\0中文te@@~eng TE./。。。');
INSERT INTO pipe_db_fvt2.t1 VALUES('2969-1-6 00:00:00',96,-10001,10000001,-100000000001,1047200.00312001,1109810.113011921,false,'2023-6-23 05:00:00.55','test数据库语法查询测试！！！@TEST6-8','test数据库语法查询测试！！！@TEST6-9','test数据库语法查询测试！！！@TEST6-10','t','test数据库语法查询测试！！！@TEST6-12','中','test数据库语法查询测试！！！@TEST6-14','test数据库语法查询测试！！！@TEST6-15','test数据库语法查询测试！TEST6-16xaa','test数据库语法查询测试！！！@TEST6-17','test数据库语法查询测试！！！@TEST6-18',b'\xca','test数据库语法查询测试！！！@TEST6-20','test数据库语法查询测试！！！@TEST6-21','test数据库语法查询测试！！！@TEST6-22',9,-10000001,100000000001,424721.022311,4909810.11301191,true,'test数据库语法查询测试！！！@TEST6-7','\0\0中文te@@~eng TE./。\0\\0\0',b'\xdd','test数据库语法查询测试！！！@TEST6-10','test数据库语法查询测试！！！@TEST6-11','test数据库语法查询测试！！！@TEST6-12','t3','\0\0中文te@@~eng TE./。。。','中','\0\0中文te@@~eng TE./。。。');
INSERT INTO pipe_db_fvt2.t1 VALUES('2969-1-7 00:00:00',97,-20002,20000002,-200000000002,20873209.0220322201,22012110.113011921,true,'2016-7-17 20:12:00.12','test数据库语法查询测试！！！@TEST7-8','test数据库语法查询测试！！！@TEST7-9','test数据库语法查询测试！！！@TEST7-10','t','test数据库语法查询测试！！！@TEST7-12','中','test数据库语法查询测试！！！@TEST7-14','test数据库语法查询测试！！！@TEST7-15','test数据库语法查询测试！TEST7-16xaa','test数据库语法查询测试！！！@TEST7-17','test数据库语法查询测试！！！@TEST7-18',b'\xca','test数据库语法查询测试！！！@TEST7-20','test数据库语法查询测试！！！@TEST7-21','test数据库语法查询测试！！！@TEST7-22',9,20000002,-200000000002,555500.0055505,55505532.553015321,false,'test数据库语法查询测试！！！@TEST7-7','\0\0中文te@@~eng TE./。\0\\0\0',b'\xee','test数据库语法查询测试！！！@TEST7-10','test数据库语法查询测试！！！@TEST7-11','test数据库语法查询测试！！！@TEST7-12','t3','\0\0中文te@@~eng TE./。。。','中','\0\0中文te@@~eng TE./。。。');
INSERT INTO pipe_db_fvt2.t1 VALUES('2969-1-8 00:00:00',98,-30003,30000003,-300000000003,33472098.11312001,39009810.333011921,false,4565476,'test数据库语法查询测试！！！@TEST8-8','test数据库语法查询测试！！！@TEST8-9','test数据库语法查询测试！！！@TEST8-10','t','test数据库语法查询测试！！！@TEST8-12','中','test数据库语法查询测试！！！@TEST8-14','test数据库语法查询测试！！！@TEST8-15','test数据库语法查询测试！TEST8-16xaa','test数据库语法查询测试！！！@TEST8-17','test数据库语法查询测试！！！@TEST8-18',b'\xca','test数据库语法查询测试！！！@TEST8-20','test数据库语法查询测试！！！@TEST8-21','test数据库语法查询测试！！！@TEST8-22',9,-30000003,300000000003,6900.0012345,6612.1215,true,'test数据库语法查询测试！！！@TEST8-7','\0\0中文te@@~eng TE./。\0\\0\0',b'\xff','test数据库语法查询测试！！！@TEST8-10','test数据库语法查询测试！！！@TEST8-11','test数据库语法查询测试！！！@TEST8-12','t3','\0\0中文te@@~eng TE./。。。','中','\0\0中文te@@~eng TE./。。。');
INSERT INTO pipe_db_fvt2.t1 VALUES('2969-1-9 00:00:00',99,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,9,null,null,null,null,true,null,'\0\0中文te@@~eng TE./。\0\\0\0',null,null,null,null,null,'\0\0中文te@@~eng TE./。。。',null,'\0\0中文te@@~eng TE./。。。');
INSERT INTO pipe_db_fvt2.t1 VALUES('2970-1-1 00:00:00',100,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,9,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'\0\0中文te@@~eng TE./。。。' ,'\'  ,'\0\0中文te@@~eng TE./。。。');
select pg_sleep(2);
select * from defaultdb.mock_sink_to_db where topic='test_topic_mock1' order by key;
select count(*) from pipe_db_fvt2.t1 where e1>50;
select count(*) from defaultdb.mock_sink_to_db where topic='test_topic_mock1';

select count(*) from pipe_db_fvt2.t1 where code1=0 AND code8='a' AND code14='w' AND code16='a';
select count(*) from defaultdb.mock_sink_to_db where topic='test_topic_mock2';

-- alter table pipe_db_fvt2.t1 rename e22 to e222;
-- alter table pipe_db_fvt2.t1 drop column e222;
-- alter table pipe_db_fvt2.t1 alter column e18 type CHAR(256);
-- alter table pipe_db_fvt2.t1 rename code12 to code12_1;
-- alter table pipe_db_fvt2.t1 alter tag code12 type VARCHAR(30);
-- alter table pipe_db_fvt2.t1 drop tag code12;
-- history and ddl hang
--alter table pipe_db_fvt2.t1 add column e100 int;
--alter table pipe_db_fvt2.t1 add tag code100 int;
--
-- --select pg_sleep(2);
alter pipe test_pipe_mock1 set enable='off';
alter pipe test_pipe_mock2 set enable='off';

alter table pipe_db_fvt2.t1 add column e100 int;
alter table pipe_db_fvt2.t1 rename e22 to e222;
alter table pipe_db_fvt2.t1 rename code12 to code12_1;
alter table pipe_db_fvt2.t1 drop column e22;
alter table pipe_db_fvt2.t1 drop tag code12;
alter table pipe_db_fvt2.t1 alter column e18 type CHAR(100);
alter table pipe_db_fvt2.t1 alter tag code12 type VARCHAR(30);

alter table pipe_db_fvt2.t1 add column e22 NVARCHAR;
alter table pipe_db_fvt2.t1 add column e101 NCHAR(255);
alter table pipe_db_fvt2.t1 add column e102 VARCHAR(4096);
alter table pipe_db_fvt2.t1 add column e103 CHAR(255);
alter table pipe_db_fvt2.t1 add tag code100 int;
alter table pipe_db_fvt2.t1 add tag code101 NCHAR(254);
alter table pipe_db_fvt2.t1 add tag code102 VARCHAR(4096);
alter table pipe_db_fvt2.t1 add tag code103 CHAR(255);

CREATE PIPE test_pipe_mock3 FOR TABLE pipe_db_fvt2.t1(*)
       WHERE (code1=3 OR code8='test数据库语法查询测试！！！@TEST3-8')
       AND (e100 > 20
       OR (e101='e101\0\0中文te@@~eng TE./。\0\\0\0'
       OR e102='e102\0\0中文te@@~eng TE./。\0\\0\0'
       OR e103='e103\0\0中文te@@~eng TE./。\0\\0\0')
       )
       WITH OPTIONS (sink='mock://localhost:9095?topic_name=test_topic_mock3');

alter pipe test_pipe_mock1 set enable='on';

INSERT INTO pipe_db_fvt2.t1 (e101,e102,e103,code101,code102,code103,k_timestamp, id, e1, e2, e3, e4, e5, e6, e7, e8, e9, e10, e11, e12, e13, e14, e15, e16, e17, e18, e19, e20, e21, e22,e100,code100,code16, code1, code14, code8)
VALUES('e101\0\0中文te@@~eng TE./。\0\\0\0','e102\0\0中文te@@~eng TE./。\0\\0\0','e103\0\0中文te@@~eng TE./。\0\\0\0','\0\0中文te@@~eng TE./。\0\\0\0','\0\0中文te@@~eng TE./。\0\\0\0','\0\0中文te@@~eng TE./。\0\\0\0','0000-1-1 00:10:00',1,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,100,100,'after_alter_code16_1添加数据列和tag列中文te@@~eng TE./',0,'after_alter_code14_1添加数据列中文te@@~eng TE./','after_alter_code8_1添加数据列中文te@@~eng TE./');

INSERT INTO pipe_db_fvt2.t1 (e101,e102,e103,code101,code102,code103,k_timestamp, id, e7, e8, e9, e1, e2, e3, e4, e5, e6, e10, e11, e12, e13, e14, e15, e16, e17, e18, e19, e20, e21, e22,e100,code100,code16, code1, code14, code8)
VALUES('e101\0\0中文te@@~eng TE./。\0\\0\0','e102\0\0中文te@@~eng TE./。\0\\0\0','e103\0\0中文te@@~eng TE./。\0\\0\0','\0\0中文te@@~eng TE./。\0\\0\0','\0\0中文te@@~eng TE./。\0\\0\0','\0\0中文te@@~eng TE./。\0\\0\0','0000-1-1 00:20:00',1,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,-1,1,-1,1.125,-2.125,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,100,100,'after_alter_code16_1添加数据列和tag列中文te@@~eng TE./',0,'after_alter_code14_1添加数据列中文te@@~eng TE./','after_alter_code8_1添加数据列中文te@@~eng TE./');

INSERT INTO pipe_db_fvt2.t1 (e101,e102,e103,code101,code102,code103,k_timestamp, id, e1, e2, e3, e4, e5, e6, e7, e8, e9, e10, e11, e12, e13, e14, e15, e16, e17, e18, e19, e20, e21, e22,e100,code16, code1, code14, code8)
VALUES('e101\0\0中文te@@~eng TE./。\0\\0\0','e102\0\0中文te@@~eng TE./。\0\\0\0','e103\0\0中文te@@~eng TE./。\0\\0\0','\0\0中文te@@~eng TE./。\0\\0\0','\0\0中文te@@~eng TE./。\0\\0\0','\0\0中文te@@~eng TE./。\0\\0\0','0000-1-1 00:30:00',1,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,100,'after_alter_code16_1添加数据列和tag列中文te@@~eng TE./',0,'after_alter_code14_1添加数据列中文te@@~eng TE./','after_alter_code8_1添加数据列中文te@@~eng TE./');

INSERT INTO pipe_db_fvt2.t1 (e101,e102,e103,k_timestamp, id, e1, e2, e3, e4, e5, e6, e7, e8, e9, e10, e11, e12, e13, e14, e15, e16, e17, e18, e19, e20, e21, e22,e100,code16, code1, code14, code8)
VALUES('e101\0\0中文te@@~eng TE./。\0\\0\0','e102\0\0中文te@@~eng TE./。\0\\0\0','e103\0\0中文te@@~eng TE./。\0\\0\0','0000-1-1 00:40:00',1,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,100,'after_alter_code16_1添加数据列和tag列中文te@@~eng TE./',0,'after_alter_code14_1添加数据列中文te@@~eng TE./','after_alter_code8_1添加数据列中文te@@~eng TE./');

select name,table_name,status from [show pipes] where name like '%mock%';
select count(*) from pipe_db_fvt2.t1  WHERE
        (code1=3 OR code8='test数据库语法查询测试！！！@TEST3-8')
        AND (e100 > 20
        OR (e101='e101\0\0中文te@@~eng TE./。\0\\0\0'
            OR e102='e102\0\0中文te@@~eng TE./。\0\\0\0'
            OR e103='e103\0\0中文te@@~eng TE./。\0\\0\0')
        );
select count(*) from defaultdb.mock_sink_to_db where topic='test_topic_mock3';

-- drop/add columns and tags before pipe creation
alter table pipe_db_fvt2.t2 drop column e1;
alter table pipe_db_fvt2.t2 drop column e2;
alter table pipe_db_fvt2.t2 drop column e3;
alter table pipe_db_fvt2.t2 drop column e4;
alter table pipe_db_fvt2.t2 drop column e5;
alter table pipe_db_fvt2.t2 drop column e6;
alter table pipe_db_fvt2.t2 drop column e7;
alter table pipe_db_fvt2.t2 drop column e8;
alter table pipe_db_fvt2.t2 drop column e9;
alter table pipe_db_fvt2.t2 drop column e10;
alter table pipe_db_fvt2.t2 drop column e11;
alter table pipe_db_fvt2.t2 drop column e12;
alter table pipe_db_fvt2.t2 drop column e13;
alter table pipe_db_fvt2.t2 drop column e14;
alter table pipe_db_fvt2.t2 drop column e15;
alter table pipe_db_fvt2.t2 drop column e16;
alter table pipe_db_fvt2.t2 drop column e17;
alter table pipe_db_fvt2.t2 drop column e18;
alter table pipe_db_fvt2.t2 drop column e19;
alter table pipe_db_fvt2.t2 drop column e20;
alter table pipe_db_fvt2.t2 drop column e21;
alter table pipe_db_fvt2.t2 drop column e22;

alter table pipe_db_fvt2.t2 drop tag code2;
alter table pipe_db_fvt2.t2 drop tag code3;
alter table pipe_db_fvt2.t2 drop tag code4;
alter table pipe_db_fvt2.t2 drop tag code5;
alter table pipe_db_fvt2.t2 drop tag code6;
alter table pipe_db_fvt2.t2 drop tag code7;
alter table pipe_db_fvt2.t2 drop tag code9;
alter table pipe_db_fvt2.t2 drop tag code10;


alter table pipe_db_fvt2.t2 add column e100 int;
alter table pipe_db_fvt2.t2 add column e101 NCHAR(255);
alter table pipe_db_fvt2.t2 add column e102 VARCHAR(4096);
alter table pipe_db_fvt2.t2 add column e103 CHAR(255);
alter table pipe_db_fvt2.t2 add tag code100 int;
alter table pipe_db_fvt2.t2 add tag code101 NCHAR(254);
alter table pipe_db_fvt2.t2 add tag code102 VARCHAR(4096);
alter table pipe_db_fvt2.t2 add tag code103 CHAR(255);

CREATE PIPE test_pipe_mock11 FOR TABLE pipe_db_fvt2.t2(*)
       WHERE (code1=3 OR code8='after_alter_code8_1添加数据列中文te@@~eng TE./_include')
       AND (e100 > 20
       OR (e101='e101\0\0中文te@@~eng TE./。\0\\0\0'
       OR e102='e102\0\0中文te@@~eng TE./。\0\\0\0'
       OR e103='e103\0\0中文te@@~eng TE./。\0\\0\0')
       )
       WITH OPTIONS (buffer_size='0',
       sink='mock://root@127.0.102.145:26257?topic_name=test_topic_mock11&mock_sink_to_db=defaultdb.mock_sink_to_db');
select pg_sleep(2);

INSERT INTO pipe_db_fvt2.t2 (e101,e102,e103,code101,code102,code103,k_timestamp, id, e100,code100,code16, code1, code14, code8)
VALUES('e101\0\0中文te@@~eng TE./。\0\\0\0','e102\0\0中文te@@~eng TE./。\0\\0\0','e103\0\0中文te@@~eng TE./。\0\\0\0','\0\0中文te@@~eng TE./。\0\\0\0','\0\0中文te@@~eng TE./。\0\\0\0','\0\0中文te@@~eng TE./。\0\\0\0','0000-1-1 00:10:00',1,100,100,'after_alter_code16_1添加数据列和tag列中文te@@~eng TE./',0,'after_alter_code14_1添加数据列中文te@@~eng TE./','after_alter_code8_1添加数据列中文te@@~eng TE./');

INSERT INTO pipe_db_fvt2.t2 (e101,e102,e103,code101,code102,code103,k_timestamp, id, e100,code100,code16, code1, code14, code8)
VALUES('e101\0\0中文te@@~eng TE./。\0\\0\0','e102\0\0中文te@@~eng TE./。\0\\0\0','e103\0\0中文te@@~eng TE./。\0\\0\0','\0\0中文te@@~eng TE./。\0\\0\0','\0\0中文te@@~eng TE./。\0\\0\0','\0\0中文te@@~eng TE./。\0\\0\0','0000-1-1 00:20:00',1,100,100,'after_alter_code16_1添加数据列和tag列中文te@@~eng TE./',1,'after_alter_code14_1添加数据列中文te@@~eng TE./','after_alter_code8_1添加数据列中文te@@~eng TE./');


INSERT INTO pipe_db_fvt2.t2 (e101,e102,e103,code101,code102,code103,k_timestamp, id, e100,code16, code1, code14, code8)
VALUES('e101\0\0中文te@@~eng TE./。\0\\0\0','e102\0\0中文te@@~eng TE./。\0\\0\0','e103\0\0中文te@@~eng TE./。\0\\0\0','\0\0中文te@@~eng TE./。\0\\0\0','\0\0中文te@@~eng TE./。\0\\0\0','\0\0中文te@@~eng TE./。\0\\0\0','0000-1-1 00:30:00',1,100,'after_alter_code16_1添加数据列和tag列中文te@@~eng TE./',2,'after_alter_code14_1添加数据列中文te@@~eng TE./','after_alter_code8_1添加数据列中文te@@~eng TE./_include');

INSERT INTO pipe_db_fvt2.t2 (e101,e102,e103,k_timestamp, id, e100,code16, code1, code14, code8)
VALUES('e101\0\0中文te@@~eng TE./。\0\\0\0','e102\0\0中文te@@~eng TE./。\0\\0\0','e103\0\0中文te@@~eng TE./。\0\\0\0','0000-1-1 00:40:00',1,100,'after_alter_code16_1添加数据列和tag列中文te@@~eng TE./',3,'after_alter_code14_1添加数据列中文te@@~eng TE./','after_alter_code8_1添加数据列中文te@@~eng TE./');

drop table pipe_db_fvt2.t1 cascade;
drop table pipe_db_fvt2.t2 cascade;
DROP PIPE test_pipe_mock1;
DROP PIPE test_pipe_mock2;
DROP PIPE test_pipe_mock3;
DROP PIPE test_pipe_mock11;

-- mock test 2
CREATE TABLE pipe_db_fvt2.t1
(
    k_timestamp TIMESTAMPTZ NOT NULL,
    id          INT         NOT NULL,
    e1          INT2,
    e2          INT,
    e3          INT8,
    e4          FLOAT4,
    e5          FLOAT8,
    e6          BOOL,
    e7          TIMESTAMPTZ,
    e8          CHAR(1023),
    e9          NCHAR(255),
    e10         VARCHAR(4096),
    e11         CHAR,
    e12         CHAR(255),
    e13         NCHAR,
    e14         NVARCHAR(4096),
    e15         VARCHAR(1023),
    e16         NVARCHAR(200),
    e17         NCHAR(255),
    e18         CHAR(200),
    e19         VARBYTES,
    e20         VARBYTES(60),
    e21         VARCHAR,
    e22         NVARCHAR
) ATTRIBUTES (code1 INT2 NOT NULL,code2 INT,code3 INT8,
            code4 FLOAT4 ,code5 FLOAT8,
                        code6 BOOL,
                        code7 VARCHAR,code8 VARCHAR(128) NOT NULL,
                        code9 VARBYTES,code10 VARBYTES(60),
                        code11 VARCHAR,code12 VARCHAR(60),
                        code13 CHAR(2),code14 CHAR(1023) NOT NULL,
                        code15 NCHAR,code16 NCHAR(254) NOT NULL)
PRIMARY TAGS(code1,code14,code8,code16);
CREATE TABLE pipe_db_fvt2.t2
(
    k_timestamp TIMESTAMPTZ NOT NULL,
    id          INT         NOT NULL,
    e1          INT2,
    e2          INT,
    e3          INT8,
    e4          FLOAT4,
    e5          FLOAT8,
    e6          BOOL,
    e7          TIMESTAMPTZ,
    e8          CHAR(1023),
    e9          NCHAR(255),
    e10         VARCHAR(4096),
    e11         CHAR,
    e12         CHAR(255),
    e13         NCHAR,
    e14         NVARCHAR(4096),
    e15         VARCHAR(1023),
    e16         NVARCHAR(200),
    e17         NCHAR(255),
    e18         CHAR(200),
    e19         VARBYTES,
    e20         VARBYTES(60),
    e21         VARCHAR,
    e22         NVARCHAR
) ATTRIBUTES (code1 INT2 NOT NULL,code2 INT,code3 INT8,
            code4 FLOAT4 ,code5 FLOAT8,
                        code6 BOOL,
                        code7 VARCHAR,code8 VARCHAR(128) NOT NULL,
                        code9 VARBYTES,code10 VARBYTES(60),
                        code11 VARCHAR,code12 VARCHAR(60),
                        code13 CHAR(2),code14 CHAR(1023) NOT NULL,
                        code15 NCHAR,code16 NCHAR(254) NOT NULL)
PRIMARY TAGS(code1,code14,code8,code16);

-- create multi-table pipe
create pipe test_pipe_mock_20 for table pipe_db_fvt2.t1,pipe_db_fvt2.t2
       with options (enable='off',
       sink='mock://root@127.0.102.145:26257?topic_name=test_topic_mock20&mock_sink_to_db=defaultdb.mock_sink_to_db');
create pipe test_pipe_mock_20_1 for table pipe_db_fvt2.t1,pipe_db_fvt2.t2 where e1>0
       with options (enable='off',sink='mock://localhost:9095?topic_name=test_topic_mock20');

-- create database pipe
create pipe test_pipe_mock_21 for database pipe_db_fvt2
       with options (enable='off',ignore_history='on',
       sink='mock://root@127.0.102.145:26257?topic_name=test_topic_mock21&mock_sink_to_db=defaultdb.mock_sink_to_db');
create pipe test_pipe_mock_21_1 for database pipe_db_fvt2 where e1>0
       with options (enable='off',ignore_history='on',sink='mock://localhost:9095?topic_name=test_topic_mock21_1');

-- create pipe on single table
create pipe test_pipe_mock_23 for table pipe_db_fvt2.t1(k_timestamp,id,code1,code2,code14,code8,code16) where e1>0
       with options (enable='off',ignore_history='on',publish='insert,update',buffer_size='0',
       sink='mock://root@127.0.102.145:26257?topic_name=test_topic_mock23&mock_sink_to_db=defaultdb.mock_sink_to_db');
ALTER TABLE pipe_db_fvt2.t1 ALTER COLUMN e1 SET DATA TYPE VARCHAR;
alter pipe test_pipe_mock_23 set enable='on';
ALTER TABLE pipe_db_fvt2.t1 ALTER COLUMN e1 SET DATA TYPE INT2;
alter pipe test_pipe_mock_23 set enable='on';
select pg_sleep(5);
INSERT INTO pipe_db_fvt2.t1 (k_timestamp,id,e1,code1,code14,code8,code16),VALUES('2022-02-01 00:00:00',1,10,10,'1','1','1');
UPDATE pipe_db_fvt2.t1 SET code3=300 WHERE code1=10 AND code14='1' AND code8='1' AND code16='1';
alter pipe test_pipe_mock_23 set enable='off';
alter pipe test_pipe_mock_23 set ignore_history='off',publish='all';

select name,
       table_name,
       column_names,
       filter,
       options,
       low_watermark,
       status,
       create_by,
       error_message
from [show pipes] where name like '%mock_2%';

--DDL on disabled pipe
drop database if exists pipe_db_fvt2 cascade;
alter table pipe_db_fvt2.t1 add column e60 bool;
alter table pipe_db_fvt2.t1 drop column e60;
alter table pipe_db_fvt2.t1 add tag code60 bool;
alter table pipe_db_fvt2.t1 drop tag code60;

CREATE TABLE pipe_db_fvt2.t3
(
    k_timestamp TIMESTAMPTZ NOT NULL,
    id          INT         NOT NULL,
    e1          INT2,
    e2          INT,
    e3          INT8,
    e4          FLOAT4,
    e5          FLOAT8,
    e6          BOOL,
    e7          TIMESTAMPTZ,
    e8          CHAR(1023),
    e9          NCHAR(255),
    e10         VARCHAR(4096),
    e11         CHAR,
    e12         CHAR(255),
    e13         NCHAR,
    e14         NVARCHAR(4096),
    e15         VARCHAR(1023),
    e16         NVARCHAR(200),
    e17         NCHAR(255),
    e18         CHAR(200),
    e19         VARBYTES,
    e20         VARBYTES(60),
    e21         VARCHAR,
    e22         NVARCHAR
) ATTRIBUTES (code1 INT2 NOT NULL,code2 INT,code3 INT8,
            code4 FLOAT4 ,code5 FLOAT8,
                        code6 BOOL,
                        code7 VARCHAR,code8 VARCHAR(128) NOT NULL,
                        code9 VARBYTES,code10 VARBYTES(60),
                        code11 VARCHAR,code12 VARCHAR(60),
                        code13 CHAR(2),code14 CHAR(1023) NOT NULL,
                        code15 NCHAR,code16 NCHAR(254) NOT NULL)
PRIMARY TAGS(code1,code14,code8,code16);
drop table pipe_db_fvt2.t3;

alter pipe test_pipe_mock_20 set publish = 'insert,update,delete',buffer_size='0';
alter pipe test_pipe_mock_20 set table 'pipe_db_fvt2.t1' where e1>0;
alter pipe test_pipe_mock_21 set database 'pipe_db_fvt1';
alter pipe test_pipe_mock_21 set publish = 'all',buffer_size='0';
alter pipe test_pipe_mock_20 set enable='on';
alter pipe test_pipe_mock_21 set enable='on';
select pg_sleep(2);
alter pipe test_pipe_mock_20 set buffer_size = '0';
alter pipe test_pipe_mock_21 set ignore_history = 'on';

--delete and update
INSERT INTO pipe_db_fvt2.t1 (k_timestamp,id,code1,code14,code8,code16) VALUES('2022-01-01 00:00:00',1,1,'1','1','1');
INSERT INTO pipe_db_fvt2.t1 (k_timestamp,id,code1,code14,code8,code16) VALUES('2022-01-01 00:00:01',1,1,'1','1','1');
INSERT INTO pipe_db_fvt2.t1 (k_timestamp,id,code1,code14,code8,code16) VALUES('2022-01-01 00:01:01',1,5,'5','5','5');
UPDATE pipe_db_fvt2.t1 SET code2=222 WHERE code1=1 AND code14='1' AND code8='1' AND code16='1';
UPDATE pipe_db_fvt2.t1 SET code3=221 WHERE code1=1 AND code14='1' AND code8='1' AND code16='1';
delete from pipe_db_fvt2.t1  where k_timestamp='2022-01-01 00:00:01' and code1=1 AND code14='1' AND code8='1' AND code16='1';
delete from pipe_db_fvt2.t1  where  code1=5 AND code14='5' AND code8='5' AND code16='5';

--check delete and update
--count 4
select topic,kind,db_name,tb_name,data from defaultdb.mock_sink_to_db where topic = 'test_topic_mock20';
--2 rows
select topic,kind,db_name,tb_name,data
from defaultdb.mock_sink_to_db where topic = 'test_topic_mock21' and kind != 'insert';

--DDL on enable pipe
drop table pipe_db_fvt2.t2;
select name,table_name,status,error_message from [show pipes] where name in ('test_pipe_mock_20','test_pipe_mock_21');

CREATE TABLE pipe_db_fvt2.t3
(
    k_timestamp TIMESTAMPTZ NOT NULL,
    id          INT         NOT NULL,
    e1          INT2,
    e2          INT,
    e3          INT8,
    e4          FLOAT4,
    e5          FLOAT8,
    e6          BOOL,
    e7          TIMESTAMPTZ,
    e8          CHAR(1023),
    e9          NCHAR(255),
    e10         VARCHAR(4096),
    e11         CHAR,
    e12         CHAR(255),
    e13         NCHAR,
    e14         NVARCHAR(4096),
    e15         VARCHAR(1023),
    e16         NVARCHAR(200),
    e17         NCHAR(255),
    e18         CHAR(200),
    e19         VARBYTES,
    e20         VARBYTES(60),
    e21         VARCHAR,
    e22         NVARCHAR
) ATTRIBUTES (code1 INT2 NOT NULL,code2 INT,code3 INT8,
            code4 FLOAT4 ,code5 FLOAT8,
                        code6 BOOL,
                        code7 VARCHAR,code8 VARCHAR(128) NOT NULL,
                        code9 VARBYTES,code10 VARBYTES(60),
                        code11 VARCHAR,code12 VARCHAR(60),
                        code13 CHAR(2),code14 CHAR(1023) NOT NULL,
                        code15 NCHAR,code16 NCHAR(254) NOT NULL)
PRIMARY TAGS(code1,code14,code8,code16);

select name,table_name,status,error_message from [show pipes] where name = 'test_pipe_mock_21';

alter table pipe_db_fvt2.t3 add column e60 bool;
alter table pipe_db_fvt2.t3 drop column e60;
alter table pipe_db_fvt2.t3 add tag code60 bool;
alter table pipe_db_fvt2.t3 drop tag code60;
-- wait pipe restart after DDL
select pg_sleep(2);

--import 1 rows
EXPORT INTO CSV "nodelocal://1/a" FROM TABLE pipe_db_fvt2.t1;
IMPORT INTO pipe_db_fvt2.t3 CSV DATA ("nodelocal://1/a");

--insert into select 1 rows
insert into pipe_db_fvt2.t3 select * from pipe_db_fvt2.t1;

INSERT INTO pipe_db_fvt2.t1 VALUES('2969-1-1 00:00:00',91,0,0,0,0,0,true,0,'','','','','','','','','','','','','','','',9,0,0,0,0,false,'','\0\0中文te@@~eng TE./。\0\\0\0','','','','','','\0\0中文te@@~eng TE./。。。','','\0\0中文te@@~eng TE./。。。');
INSERT INTO pipe_db_fvt2.t1 VALUES('2969-1-2 00:00:00',92,0,0,0,0,0,true,999999,'          ','          ','          ',' ','          ',' ',' ','          ','          ','          ',' ',' ','          ','          ','          ',9,0,0,0,0,TRUE,'          ','\0\0中文te@@~eng TE./。\0\\0\0',' ','          ','          ','          ','  ','\0\0中文te@@~eng TE./。。。',' ','\0\0中文te@@~eng TE./。。。');
INSERT INTO pipe_db_fvt2.t1 VALUES('2969-1-3 00:00:00',93,10001,10000001,100000000001,-1047200.00312001,-1109810.113011921,true,'2021-3-1 12:00:00.909','test数据库语法查询测试！！！@TEST3-8','test数据库语法查询测试！！！@TEST3-9','test数据库语法查询测试！！！@TEST3-10','t','test数据库语法查询测试！！！@TEST3-12','中','test数据库语法查询测试！！！@TEST3-14','test数据库语法查询测试！！！@TEST3-15','test数据库语法查询测试！TEST3-16xaa','test数据库语法查询测试！！！@TEST3-17','test数据库语法查询测试！！！@TEST3-18',b'\xca','test数据库语法查询测试！！！@TEST3-20','test数据库语法查询测试！！！@TEST3-21','test数据库语法查询测试！！！@TEST3-22',9,10000001,-100000000001,1047200.00312001,-1109810.113011921,false,'test数据库语法查询测试！！！@TEST3-7','\0\0中文te@@~eng TE./。\0\\0\0',b'\xaa','test数据库语法查询测试！！！@TEST3-10','test数据库语法查询测试！！！@TEST3-11','test数据库语法查询测试！！！@TEST3-12','t3','\0\0中文te@@~eng TE./。。。','中','\0\0中文te@@~eng TE./。。。');
INSERT INTO pipe_db_fvt2.t1 VALUES('2969-1-4 00:00:00',94,20002,20000002,200000000002,-20873209.0220322201,-22012110.113011921,false,123,'test数据库语法查询测试！！！@TEST4-8','test数据库语法查询测试！！！@TEST4-9','test数据库语法查询测试！！！@TEST4-10','t','test数据库语法查询测试！！！@TEST4-12','中','test数据库语法查询测试！！！@TEST4-14','test数据库语法查询测试！！！@TEST4-15','test数据库语法查询测试！TEST4-16xaa','test数据库语法查询测试！！！@TEST4-17','test数据库语法查询测试！！！@TEST4-18',b'\xca','test数据库语法查询测试！！！@TEST4-20','test数据库语法查询测试！！！@TEST4-21','test数据库语法查询测试！！！@TEST4-22',9,-20000002,200000000002,-20873209.0220322201,22012110.113011921,true,'test数据库语法查询测试！！！@TEST4-7','\0\0中文te@@~eng TE./。\0\\0\0',b'\xbb','test数据库语法查询测试！！！@TEST4-10','test数据库语法查询测试！！！@TEST4-11','test数据库语法查询测试！！！@TEST4-12','t3','\0\0中文te@@~eng TE./。。。','中','\0\0中文te@@~eng TE./。。。');
INSERT INTO pipe_db_fvt2.t1 VALUES('2969-1-5 00:00:00',95,30003,30000003,300000000003,-33472098.11312001,-39009810.333011921,true,'2015-3-12 10:00:00.234','test数据库语法查询测试！！！@TEST5-8','test数据库语法查询测试！！！@TEST5-9','test数据库语法查询测试！！！@TEST5-10','t','test数据库语法查询测试！！！@TEST5-12','中','test数据库语法查询测试！！！@TEST5-14','test数据库语法查询测试！！！@TEST5-15','test数据库语法查询测试！TEST5-16xaa','test数据库语法查询测试！！！@TEST5-17','test数据库语法查询测试！！！@TEST5-18',b'\xca','test数据库语法查询测试！！！@TEST5-20','test数据库语法查询测试！！！@TEST5-21','test数据库语法查询测试！！！@TEST5-22',9,30000003,-300000000003,33472098.11312001,-39009810.333011921,false,'test数据库语法查询测试！！！@TEST5-7','\0\0中文te@@~eng TE./。\0\\0\0',b'\xcc','test数据库语法查询测试！！！@TEST5-10','test数据库语法查询测试！！！@TEST5-11','test数据库语法查询测试！！！@TEST5-12','t3','\0\0中文te@@~eng TE./。。。','中','\0\0中文te@@~eng TE./。。。');
INSERT INTO pipe_db_fvt2.t1 VALUES('2969-1-6 00:00:00',96,-10001,10000001,-100000000001,1047200.00312001,1109810.113011921,false,'2023-6-23 05:00:00.55','test数据库语法查询测试！！！@TEST6-8','test数据库语法查询测试！！！@TEST6-9','test数据库语法查询测试！！！@TEST6-10','t','test数据库语法查询测试！！！@TEST6-12','中','test数据库语法查询测试！！！@TEST6-14','test数据库语法查询测试！！！@TEST6-15','test数据库语法查询测试！TEST6-16xaa','test数据库语法查询测试！！！@TEST6-17','test数据库语法查询测试！！！@TEST6-18',b'\xca','test数据库语法查询测试！！！@TEST6-20','test数据库语法查询测试！！！@TEST6-21','test数据库语法查询测试！！！@TEST6-22',9,-10000001,100000000001,424721.022311,4909810.11301191,true,'test数据库语法查询测试！！！@TEST6-7','\0\0中文te@@~eng TE./。\0\\0\0',b'\xdd','test数据库语法查询测试！！！@TEST6-10','test数据库语法查询测试！！！@TEST6-11','test数据库语法查询测试！！！@TEST6-12','t3','\0\0中文te@@~eng TE./。。。','中','\0\0中文te@@~eng TE./。。。');
INSERT INTO pipe_db_fvt2.t1 VALUES('2969-1-7 00:00:00',97,-20002,20000002,-200000000002,20873209.0220322201,22012110.113011921,true,'2016-7-17 20:12:00.12','test数据库语法查询测试！！！@TEST7-8','test数据库语法查询测试！！！@TEST7-9','test数据库语法查询测试！！！@TEST7-10','t','test数据库语法查询测试！！！@TEST7-12','中','test数据库语法查询测试！！！@TEST7-14','test数据库语法查询测试！！！@TEST7-15','test数据库语法查询测试！TEST7-16xaa','test数据库语法查询测试！！！@TEST7-17','test数据库语法查询测试！！！@TEST7-18',b'\xca','test数据库语法查询测试！！！@TEST7-20','test数据库语法查询测试！！！@TEST7-21','test数据库语法查询测试！！！@TEST7-22',9,20000002,-200000000002,555500.0055505,55505532.553015321,false,'test数据库语法查询测试！！！@TEST7-7','\0\0中文te@@~eng TE./。\0\\0\0',b'\xee','test数据库语法查询测试！！！@TEST7-10','test数据库语法查询测试！！！@TEST7-11','test数据库语法查询测试！！！@TEST7-12','t3','\0\0中文te@@~eng TE./。。。','中','\0\0中文te@@~eng TE./。。。');
INSERT INTO pipe_db_fvt2.t1 VALUES('2969-1-8 00:00:00',98,-30003,30000003,-300000000003,33472098.11312001,39009810.333011921,false,4565476,'test数据库语法查询测试！！！@TEST8-8','test数据库语法查询测试！！！@TEST8-9','test数据库语法查询测试！！！@TEST8-10','t','test数据库语法查询测试！！！@TEST8-12','中','test数据库语法查询测试！！！@TEST8-14','test数据库语法查询测试！！！@TEST8-15','test数据库语法查询测试！TEST8-16xaa','test数据库语法查询测试！！！@TEST8-17','test数据库语法查询测试！！！@TEST8-18',b'\xca','test数据库语法查询测试！！！@TEST8-20','test数据库语法查询测试！！！@TEST8-21','test数据库语法查询测试！！！@TEST8-22',9,-30000003,300000000003,6900.0012345,6612.1215,true,'test数据库语法查询测试！！！@TEST8-7','\0\0中文te@@~eng TE./。\0\\0\0',b'\xff','test数据库语法查询测试！！！@TEST8-10','test数据库语法查询测试！！！@TEST8-11','test数据库语法查询测试！！！@TEST8-12','t3','\0\0中文te@@~eng TE./。。。','中','\0\0中文te@@~eng TE./。。。');
INSERT INTO pipe_db_fvt2.t1 VALUES('2969-1-9 00:00:00',99,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,9,null,null,null,null,true,null,'\0\0中文te@@~eng TE./。\0\\0\0',null,null,null,null,null,'\0\0中文te@@~eng TE./。。。',null,'\0\0中文te@@~eng TE./。。。');
INSERT INTO pipe_db_fvt2.t1 VALUES('2970-1-1 00:00:00',100,-1,1,-1,1.125,-2.125,false,'2020-1-1 12:00:00.000','\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\'  ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' '  ,'中文te@@~eng TE./' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,9,0,0,0,0,false,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,' ','中文te@@~eng TE./。' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\0\0中文te@@~eng TE./。\0\\0\0' ,'\ ' ,'\0\0中文te@@~eng TE./。。。' ,'\'  ,'\0\0中文te@@~eng TE./。。。');


ALTER TABLE pipe_db_fvt2.t3 RENAME TO pipe_db_fvt2.t4;
select pg_sleep(2);

-- check send result
select name,table_name,status from [show pipes] where name like '%mock_2%';
-- -- code1 >20 total 1
select count(*) from defaultdb.mock_sink_to_db where topic = 'test_topic_mock11';
select count(*) from defaultdb.mock_sink_to_db where topic = 'test_topic_mock21' and kind = 'insert' and tb_name='t1';
select count(*) from defaultdb.mock_sink_to_db where topic = 'test_topic_mock21' and kind = 'insert' and tb_name='t3';

select * from defaultdb.mock_sink_to_db where topic = 'test_topic_mock20' and kind = 'insert' order by key;
select topic,kind,db_name,tb_name,data
from defaultdb.mock_sink_to_db where topic = 'test_topic_mock20' and kind != 'insert' order by key;

select * from defaultdb.mock_sink_to_db where topic = 'test_topic_mock21' and kind = 'insert' order by key;
select topic,kind,db_name,tb_name,data
from defaultdb.mock_sink_to_db where topic = 'test_topic_mock21' and kind != 'insert' order by key;

drop pipe test_pipe_mock_20;
drop pipe test_pipe_mock_21;

--create database pipe with history, only insert
create pipe test_pipe_mock_31 for database pipe_db_fvt2
       with options (enable='on',ignore_history='off',
       sink='mock://root@127.0.102.145:26257?topic_name=test_topic_mock31&mock_sink_to_db=defaultdb.mock_sink_to_db');
select name,table_name,status from [show pipes] where name like '%mock_3%';
-- restart pipe for unprocessed data
alter pipe test_pipe_mock_23 set low_watermark='2021-12-30 00:00:00';
alter pipe test_pipe_mock_23 set enable='on';

-- insert flight data begin history to start cdc.
--INSERT INTO pipe_db_fvt2.t1 (k_timestamp,id,e1,code1,code14,code8,code16),VALUES('2022-01-02 00:00:00',20,2,5,'2','1','2');

-- wait history process
select pg_sleep(4);
-- insert realtime data disorder
INSERT INTO pipe_db_fvt2.t1 (k_timestamp,id,e1,code1,code14,code8,code16),VALUES('2025-01-02 00:01:00',21,2,5,'2','1','2'),('2025-01-02 00:02:00',21,2,0,'2','1','2');
select pg_sleep(2);

-- check history and realtime result
-- insert 2 rows
select * from defaultdb.mock_sink_to_db where topic = 'test_topic_mock31' and kind = 'insert' order by key,tb_name;
-- snapshot 12 rows
select topic,kind,db_name,tb_name,data
from defaultdb.mock_sink_to_db where topic = 'test_topic_mock31' and kind != 'insert' order by key,tb_name;

select * from defaultdb.mock_sink_to_db where topic = 'test_topic_mock23' and kind  = 'insert'  order by key,tb_name;
select topic,kind,db_name,tb_name,data
from defaultdb.mock_sink_to_db where topic = 'test_topic_mock23' and kind != 'insert' order by key,tb_name;

DROP PIPE test_pipe_mock_23;
DROP PIPE test_pipe_mock_31;

select name,table_name,status from [show pipes];
select * from system.kwdb_unpush;
--check jobs
select * from [show jobs] where job_type='PIPE WATERMARK' and status='running';
-- -- cleanup
drop database if exists pipe_db_fvt2 cascade;
drop table defaultdb.mock_sink_to_db cascade;